cubo_rp_noslip/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

backgroundMesh
{

    xMin	-1; 
    xMax	1;
    yMin	-1;
    yMax	1;
    zMin	-1;
    zMax	1;
    xCells  50;
    yCells  50;
    zCells  50;
}

convertToMeters 1;

vertices
(
    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMin)
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMin)
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMin)
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMin)

    ($!backgroundMesh/xMin $!backgroundMesh/yMin $!backgroundMesh/zMax)
    ($!backgroundMesh/xMax $!backgroundMesh/yMin $!backgroundMesh/zMax)
    ($!backgroundMesh/xMax $!backgroundMesh/yMax $!backgroundMesh/zMax)
    ($!backgroundMesh/xMin $!backgroundMesh/yMax $!backgroundMesh/zMax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)
    (
        $!backgroundMesh/xCells
        $!backgroundMesh/yCells
        $!backgroundMesh/zCells
    )
    simpleGrading 
	(	
		1 1 1
	)
);


boundary
(
    inlet // x = -1
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet // x = 1
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    ground // z = -0.1
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    top // z = 0.1
    {
        type wall;
        faces
        (
            (4 7 6 5)
        );
    }

	front // y = -1
    {
        type wall;
        faces
        (
            (0 4 5 1)
        );
    }
	
	back // y = 1
    {
        type wall;
        faces
        (
            (3 2 6 7)
        );
    }
	

);

// ************************************************************************* //
